# LegendComponentBadViewType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LegendFailures..::..LegendComponentBadViewType Property
BuiltInFailures..::..LegendFailures Class See Also
---
Legend Components may only be placed in Legends
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LegendComponentBadViewType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LegendComponentBadViewType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LegendComponentBadViewType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LegendFailures Class
Autodesk.Revit.DB Namespace